[
  {
    "heading": "Delhi High Court seeks NIA stand on J&K MP Engineer Rashid's plea to attend Parliament",
    "date": "2025-03-12",
    "context": "The Delhi High Court on Wednesday asked the NIA to state its stand on jailed Jammu and Kashmir MP Sheikh Abdul Rashid alias Engineer Rashid's plea seeking permission to attend the ongoing session of Parliament.\r\n\r\nRashid is facing charges under the anti-terror law UAPA.\r\n\r\nA bench of Justices Prathiba M Singh and Rajneesh Kumar Gupta issued notice to the National Investigation Agency (NIA) on Rashid's appeal against the trial court order which refused to grant him custody parole or interim bail.\r\n\r\n\"Issue notice. Let objections, if any, be placed before this court on Monday,\" the bench said while listing the case for further hearing on March 18.\r\n\r\nSenior advocate N Hariharan, appearing for Rashid said, Parliament session was till April 4 and his constituency was going unrepresented.\r\n\r\n\"I represent the parliamentary constituency which has 45 per cent of entire population of J-K. Send me in custody (parole),\" he said, adding that he was earlier given the relief of custody parole for two days by the high court.\r\n\r\nCustody parole entails a prisoner being escorted by armed police personnel to the place of visit.\r\n\r\nThe NIA counsel said Rashid's regular bail plea is likely to be decided by the trial court on March 19.\r\n\r\nThe Baramulla MP, who defeated Chief Minister Omar Abdullah in the 2024 Lok Sabha polls, is facing trial in a terror funding case with the allegations that he funded separatists and terror groups in Jammu and Kashmir.\r\n\r\nAs an interim relief, the high court on February 10 allowed him a two-day custody parole to attend Parliament session on February 11 and 13.\r\n\r\nRashid has been lodged in Tihar Jail since 2019 after the NIA arrested him under the Unlawful Activities (Prevention) Act (UAPA) in the 2017 terror-funding case.",
    "imageUrl": "/uploads/1741845202106-Screenshot 2025-03-13 at 11.22.53 AM.png"
  },
  {
    "heading": "Supreme Court's ruling on interim moratorium to keep errant developers in check",
    "date": "2025-03-11",
    "context": "The recent Supreme Court order saying interim moratorium in the Insolvency and Bankruptcy Code (IBC) does not shield a company or an individual from paying regulatory dues has come as a blow to unscrupulous real estate developers, businesses, and personal guarantors using the Code to evade such payments, say experts.\r\n\r\nThe top court’s order was in connection with the penalties and execution imposed on the proprietor of East and West Builders, which is undergoing insolvency proceedings by the National Consumer Disputes Redressal Commission (NCDRC).",
    "imageUrl": "/uploads/1741845255476-Screenshot 2025-03-13 at 11.24.11 AM.png"
  },
  {
    "heading": "Karnataka High Court grants interim stay on consumer court's order against PVR for ad delays",
    "date": "2025-03-11",
    "context": "The Karnataka High Court, on Monday, issued an interim stay on a ruling by the Bengaluru Consumer Forum in a case against PVR Cinemas for delaying the screening of a movie due to prolonged ads, according to media reports. The stay, granted by Justice M Nagaprasanna, will remain in effect until March 27.\r\n\r\nThe case revolves around a delay in a film screening due to long advertisements before the movie. A complaint was filed in January last year with the Bengaluru Urban District Consumer Disputes Redressal Commission by Abhishek M R, who claimed he was affected by the long advertisements before the movie.\r\n\r\nAbhishek, in his complaint, alleged that the screening of the Vicky Kaushal starrer Sam Bahadur in December 2023 was scheduled for 4:05 pm but only began at 4:30 pm due to prolonged advertisements. This delay, he claimed, caused him to be late for work.\r\n\r\nIn February 2024, the consumer forum ruled in Abhishek’s favour, stating, “In the modern era, time is as valuable as money. Every individual’s time is precious, and no entity has the right to profit from someone else’s time. Being forced to sit idle for 25-30 minutes watching advertisements is a significant inconvenience, particularly for those with tight schedules.”\r\n\r\nThe forum also directed PVR Cinemas to compensate Abhishek with Rs 1.28 lakh for the inconvenience caused.\r\n\r\nSenior Advocate Mukul Rohatgi, representing the Multiplex Association of India, argued that advertisements and trailers before movie screenings are a longstanding industry practice. He highlighted that the Ministry of Information and Broadcasting mandates public awareness advertisements for at least five minutes.\r\n\r\n “It has always been understood that films begin 15-20 minutes after the scheduled time due to advertisements and trailers. The (consumer) forum’s ruling mandates that theatres must specify on tickets that advertisements will start at 4 pm, which interferes with a well-established business model,” Rohatgi argued.\r\n\r\nGranting an interim stay, the Karnataka High Court noted that the 'consumer forum appeared to have exceeded its jurisdiction by ruling on how a cinema should operate.'\r\n\r\n “The consumer forum entertained the complaint and issued directions as though it had jurisdiction equivalent to a public interest litigation. It went beyond its scope by dictating how a theatre should function and by prohibiting advertisements before movie screenings. On the face of it, these directions are beyond its jurisdiction,” the court observed.",
    "imageUrl": "/uploads/1741845293756-Screenshot 2025-03-13 at 11.24.47 AM.png"
  }
]